<a href="https://colab.research.google.com/github/DLOHai/TIL/blob/master/DS_level01_Pandas_%EA%B8%B0%EC%B4%88.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# DS level 01 Pandas 기초

In [0]:
import pandas as pd

In [2]:
num = [1,2,3,4,5]
num

[1, 2, 3, 4, 5]

## 1. Pandas의 자료구조
---
- Series
- DataFrame
- Index
- Parallel

### 이 중 DataFrame과 Series가 가장 주된 자료구조이다!

### Series
---
기능은 Python의 `list`와 거의 완벽하게 같다.

>Q: 그렇게 동일하면 _**왜!**_ list가 아니라 `Series`를 사용하나?

> A: Series로 바꿔줘야만 pandas의 기능을 쓸 수 있기 때문에

e.g. 리스트의 평균을 구하고 싶다.
`pandas.Series()`를 써줘야만 쓸 수 있다.

In [3]:
num.mean()

AttributeError: ignored

In [4]:
## 1차원 리스트 Series로 만들어주기
pd_num = pd.Series(num)
pd_num

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
pd_num.mean()

3.0

### DataFrame
---
pandas 사용의 70~80%가 **DataFrame** !

_**pandas의 main 자료구조 DataFrame**_

Excel이나 Spreadsheet에서 Data를 읽어오면 행렬형태가 되는데, pandas에선 DataFrame이다.

In [0]:
numbers = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]

In [7]:
## 이차원 리스트를 DataFrame으로 만들어주기
pd_nums = pd.DataFrame(numbers)
pd_nums

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

### Series 와 DataFrame의 관계
---
1. 위 DataFrame 중 1,4,7을 가지고 있는 0번  Column을 가져와보자
- 대괄호 안에 원하는 column 번호 입력

In [8]:
type(pd_nums)

pandas.core.frame.DataFrame

In [9]:
nums_0 = pd_nums[0]
nums_0

0    1
1    4
2    7
Name: 0, dtype: int64

In [10]:
type(nums_0)

pandas.core.series.Series

2. 0번 째 row를 가져와보자.

In [11]:
pd_nums.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [12]:
type(pd_nums.loc[0])

pandas.core.series.Series

**즉, DataFrame은 여러개의 Series로 이루어져 있다.**

> DataFrame은 수학적으로 Matrix

> Series는 Vector라고 생각하면 된다.

### DataFrame과 Series의 기능
---
- DataFrame과 Series 기능을 거의 대부분 공유한다.

## 2. Pandas의 Data Type

In [13]:
# int == 정수형
type(1)

int

In [14]:
# float == 실수형
type(1.0)

float

In [15]:
# str = 문자열
type("Hello, World")

str

In [16]:
odd = [1, 3, 5, 7, 9]
type(odd)

list

In [17]:
odd = pd.Series(odd)
odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [18]:
odd.dtypes

dtype('int64')

int64가 거의 default
- 요즘 컴퓨터가 다 64bit 컴퓨터이기 때문
- int32도 있지만 거의 무시하면 됨.
- Series 원소의 datatype이 전체 다 int다 -> Series도 int형

In [19]:
odd = [1,3,5,7,9.0]
odd = pd.Series(odd)
odd

0    1.0
1    3.0
2    5.0
3    7.0
4    9.0
dtype: float64

In [20]:
odd.dtypes

dtype('float64')

- 원소 중 하나라도 float면 Series datatype도 float다!
- 실수 > 정수 포함관계

> Q: 만약에 정수, 실수, 문자열이 하나의 Series에 있으면?

In [21]:
odd = [1,3,5,7,9.0, 'odd']
odd = pd.Series(odd)
odd

0      1
1      3
2      5
3      7
4      9
5    odd
dtype: object

In [22]:
odd.dtypes

dtype('O')

### Object data type
---
- string을 포함한 자료형
- dtype('O')라고 표현
- Objecct의 약자 'O'
- 문자를 pandas에선 Object / Python에선 String이라고 함
- 하나라도 string이 있으면 object
- DataFrame도 동일

### NaN (Not a Number)
- "값이 비어있다"
- 왜 이것을 별도로 명시할까?
 -> 0이나 -1로 대체할 수 있지만 통계치에서 오차가 발생할 수 있다.

In [23]:
import numpy as np

odd = [1,3,5,7,9]
odd = pd.Series(odd)
odd.dtypes

dtype('int64')

In [24]:
# 만약에 임의의 원소를 nan으로 바꾸면?
odd = [1,np.nan,5,7,9]
odd = pd.Series(odd)
odd.dtypes

dtype('float64')

In [25]:
odd.mean()

5.5

In [26]:
odd

0    1.0
1    NaN
2    5.0
3    7.0
4    9.0
dtype: float64

- pandas에서 NaN은 float형이다!
- 그럼 이걸 왜 쓸까?

In [27]:
# 그럼 nan 대신에 값이 비어있다는 것을 -1로 대체해버리면?
# 저장시엔 문제가 없지만, 데이터 분석 시에 문제가된다.
odd = [1,-1,5,7,9]
odd = pd.Series(odd)
odd.dtypes

dtype('int64')

In [28]:
odd.mean()

4.2

### NaN의 처리
- NaN 끼리는 서로 비교할 수 없다.

In [29]:
np.nan == np.nan

False

In [30]:
# isnull 비어있으면 true, 안비어있으면 false
value = np.nan
pd.isnull(value)

True

In [31]:
# 위의 반대
pd.notnull(value)

False

## 3. DataFrame 생성하기

### (1) 2차원 리스트로 만들어주는 방법 (핵비추)

In [32]:
order = [
    ['2017-01-01', 500, 'confirmed'],
    ['2017-01-01', 700, 'confirmed'],
    ['2017-01-10', 200, 'caceled'],
]

order = pd.DataFrame(order)

order

            0    1          2
0  2017-01-01  500  confirmed
1  2017-01-01  700  confirmed
2  2017-01-10  200    caceled

In [33]:
order = [
    ['2017-01-01', 500, 'confirmed'],
    ['2017-01-01', 700, 'confirmed'],
    ['2017-01-10', 200, 'caceled'],
]

columns = ['date', 'price', 'amount']
order = pd.DataFrame(order, columns = columns)

order

         date  price     amount
0  2017-01-01    500  confirmed
1  2017-01-01    700  confirmed
2  2017-01-10    200    caceled

- 하지만 이런 방식은 자주 쓰이지 않는다.
- Rows, Coulmns를 따로 설정해주어야 한다.
- 두개의 명령어 사이에 sync가 되지 않으면 에러가 난다.

In [34]:
order = [
    ['2017-01-01', 500, 'confirmed'],
    ['2017-01-01', 700, 'confirmed'],
    ['2017-01-10', 200, 'caceled'],
]

columns = ['date', 'price', 'amount', 'admin']
order = pd.DataFrame(order, columns = columns)

order

AssertionError: ignored

### (2) Dictionary 형태로 만들어 주는 방법 (python, pandas에서 추천)
- 주의사항: row와 column 개수 맞춰줘야함 안그러면 에러

In [35]:
order = {
    'date':['2017-01-01', '2017-01-03', '2017-01-10'],
    'price':[500, 700, 200],
    'state': ['confirmed', 'confirmed', 'canceled']
}

order = pd.DataFrame(order)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

In [36]:
order = {
    'date':['2017-01-01', '2017-01-03', '2017-01-10'],
    'price':[500, 700, 200, 100],
    'state': ['confirmed', 'confirmed', 'canceled']
}

order = pd.DataFrame(order)
order

ValueError: ignored

### (3) 리스트 안에 Dictionary를 넣어주는 방법
- 주의사항: 이름 오타로 잘못 지어주면 또 이상해짐
- 2번 방식보다 더 에러가 많이 뜸
- 하지만 현실적으로 하다보면 이걸 선호하게됨
- 데이터가 들어올 때 3번방식으로 들어오기 때문에
- 외부에서 보통 데이터를 가져올 때 이런식으로 되어있기 때문

In [37]:
order = [
    {'date': '2017-01-01', 'price': 500, 'state':'confirmed'},
    {'date': '2017-01-03', 'price': 700, 'state':'confirmed'},
    {'date': '2017-01-10', 'price': 200, 'state':'canceled'},
]
order = pd.DataFrame(order)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

In [38]:
order = [
    {'date': '2017-01-01', 'Price': 500, 'state':'confirmed'},
    {'date': '2017-01-03', 'price': 700, 'state':'confirmed'},
    {'date': '2017-01-10', 'price': 200, 'state':'canceled'},
]
order = pd.DataFrame(order)
order

   Price        date  price      state
0  500.0  2017-01-01    NaN  confirmed
1    NaN  2017-01-03  700.0  confirmed
2    NaN  2017-01-10  200.0   canceled

## Data Load
---
### 원격으로 File download 데이터 가져올 때 좋음

In [39]:
# csv로 다운받아야되는 것 필요 없음
order_url = "https://bit.ly/dsa-01-order"

order_url

'https://bit.ly/dsa-01-order'

In [40]:
# 결제관련 데이터
pd.read_csv(order_url)

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed
5   6        5           7  2017-01-09    600    Busan   canceled
6   7        2           5  2017-01-10    200      NaN   canceled

맨위의 id, user_id 등등 정보를 **`column`**이라고 함

### Index, Columns, Values
- row를 대변할 수 있는 column이 있다?
- 그걸 row Index로 쓰고싶다?

In [41]:
pd.read_csv(order_url, index_col="id")

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [48]:
order = pd.read_csv(order_url)
order = order.set_index("id")
order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [43]:
order.index

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64', name='id')

In [44]:
order.columns

Index(['user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [45]:
order.values

array([[3, 9, '2017-01-01', 500, 'Seoul', 'confirmed'],
       [1, 7, '2017-01-03', 700, 'Seoul', 'confirmed'],
       [3, 8, '2017-01-03', 900, 'Daejeon', 'confirmed'],
       [4, 2, '2017-01-07', 500, nan, 'canceled'],
       [7, 3, '2017-01-09', 700, 'Incheon', 'confirmed'],
       [5, 7, '2017-01-09', 600, 'Busan', 'canceled'],
       [2, 5, '2017-01-10', 200, nan, 'canceled']], dtype=object)

### Index의 타입
- index라고 적혀있지만, Series나 마찬가지다

In [46]:
type(order.index)

pandas.core.indexes.numeric.Int64Index

### column 바꿔주기

In [50]:
order.columns = ['user_id', 'product_id', 'date', 'amount', 'address', 'result' ]
order

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

### Head, Tail
- 데이터가 많아졌을 때, 다띄우면 지저분해보인다.

In [52]:
#default 5개 띄워줌
order.head()

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed

In [53]:
order.head(3)

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed

In [55]:
order.head(1)

    user_id  product_id        date  amount address     result
id
1         3           9  2017-01-01     500   Seoul  confirmed

In [56]:
order.head(10)

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [57]:
order.tail()

    user_id  product_id        date  amount  address     result
id
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [58]:
order.tail(3)

    user_id  product_id        date  amount  address     result
id
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

- Series 에서도 물론 사용할 수 있음

In [60]:
order["date"].head()

id
1    2017-01-01
2    2017-01-03
3    2017-01-03
4    2017-01-07
5    2017-01-09
Name: date, dtype: object

## Pandas 기본연산
- pandas는 데이터분석을 위한 툴
### 통계, 수학연산은 기본적으로 지원이 됨

In [61]:
order["amount"].mean()

585.7142857142857

In [63]:
order["amount"].min()

200

In [64]:
order["amount"].max()

900

In [66]:
# 왠만한 연산 상위 25% 50% 75%
order["amount"].describe()

count      7.000000
mean     585.714286
std      219.306266
min      200.000000
25%      500.000000
50%      600.000000
75%      700.000000
max      900.000000
Name: amount, dtype: float64

### 특정 column의 데이터의 종류 세기
- 중복제거

In [67]:
order["result"]

id
1    confirmed
2    confirmed
3    confirmed
4     canceled
5    confirmed
6     canceled
7     canceled
Name: result, dtype: object

In [69]:
order["result"].unique()

array(['confirmed', 'canceled'], dtype=object)

- 각 데이터 종류별 개수

In [70]:
order["result"].value_counts()

confirmed    4
canceled     3
Name: result, dtype: int64

- 상대적 수치 표현 - normalize

In [71]:
order["result"].value_counts(normalize=True)

confirmed    0.571429
canceled     0.428571
Name: result, dtype: float64

### 값을 통일하여 바꾸고 개수 세기
- confrimed, canceled -> confirm, cancel

In [72]:
order["result"].replace("confirmed", "confirm")

id
1     confirm
2     confirm
3     confirm
4    canceled
5     confirm
6    canceled
7    canceled
Name: result, dtype: object

In [76]:
order["result"].replace("confirmed", "confirm").replace("canceled","cancel")
order

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [78]:
# 위에처럼 하면 원래 데이터가 안바뀜!
order["result"] = order["result"].replace("confirmed", "confirm").replace("canceled","cancel")
order

    user_id  product_id        date  amount  address   result
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

### pandas 날짜 인식

In [80]:
#아래 데이터들은 string이다. 그럼 숫자로 어떻게 읽을까?
order["date"]

id
1    2017-01-01
2    2017-01-03
3    2017-01-03
4    2017-01-07
5    2017-01-09
6    2017-01-09
7    2017-01-10
Name: date, dtype: object

In [85]:
# 날짜라고 인식시켜줘!
pd.to_datetime(order["date"])

id
1   2017-01-01
2   2017-01-03
3   2017-01-03
4   2017-01-07
5   2017-01-09
6   2017-01-09
7   2017-01-10
Name: date, dtype: datetime64[ns]

In [86]:
order["date"]=pd.to_datetime(order["date"])
order

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

In [87]:
order["date"].dt.year

id
1    2017
2    2017
3    2017
4    2017
5    2017
6    2017
7    2017
Name: date, dtype: int64

In [88]:
order["date"].dt.month

id
1    1
2    1
3    1
4    1
5    1
6    1
7    1
Name: date, dtype: int64

In [89]:
order["date"].dt.day

id
1     1
2     3
3     3
4     7
5     9
6     9
7    10
Name: date, dtype: int64

In [90]:
order = pd.read_csv(order_url)
order = order.set_index("id")
order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [91]:
order["date"].dt.year

AttributeError: ignored